[TECH] Add primary's DNS switch
